{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/sokbaelee/Dropbox/Persuasion/STATAcodes/persuasio/persuasion_GKB_example.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Nov 2020, 21:25:17
{txt}
{com}. 
. use GKB, clear
{txt}
{com}. 
. global covariates "MBfemale Mreportedage MBvoted2004 MBvoted2002 MBvoted2001 MBconsumer MBgetsmag MBpreferrepub MBprefernoone Mwave2 MZBfemale MZreportedage MZBvoted2004 MZBvoted2002 MZBvoted2001 MZBconsumer MZBgetsmag MZBpreferrepub MZBprefernoone MZwave2"
{txt}
{com}. 
. global covariates "MBfemale Mreportedage MZBfemale MZreportedage MZBvoted2004 MZBvoted2002 MZBvoted2001 MZBconsumer MZBgetsmag MZBpreferrepub MZBprefernoone MZwave2"
{txt}
{com}. 
. 
. *********************************************************
. **** Part I: Lower Bound on Average Persuation Rate *****
. *********************************************************
. 
. persuasionyz voteddem_all post, level(80) method("normal") title("w/o covariates: normal")
w/o covariates: normal:
--- Estimating Average Persuation Rate (APR) ---
The estimated lower bound on the APR is:
.07073235
--- Inference Based on Normal Approximation ---
The standard error of the lower bound on the APR is:
.04982044
The left-end point of the confidence interval for the lower bound on the APR is:
.02880241
(Note. The one-sided nominal coverage probability is .8)
------------------------------------------------
{txt}
{com}. 
. persuasionyz voteddem_all post, level(80) method("bootstrap") nboot(1000) title("w/o covariates: bootstrap")
w/o covariates: bootstrap:
--- Estimating Average Persuation Rate (APR) ---
The estimated lower bound on the APR is:
.07073235
{txt}(running aprlb on estimation sample)

Bootstrap replications ({res}1000{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000
{res}
{txt}Bootstrap results{col 49}Number of obs{col 67}= {res}       701
{txt}{col 49}Replications{col 67}= {res}     1,000
{p2colset 7 17 21 2}{...}

{txt}{p2col :command:}aprlb voteddem_all post{p_end}
{p2colset 10 17 21 2}{...}
{p2col :coef:}{res:e(lb_coef)}{p_end}
--- Inference Based on Bootstrap ---
The left-end point of the percentile bootstrap confidence interval for the lower bound on the APR is:
.03182306
The left-end point of bc bootstrap confidence interval for the lower bound on the APR is:
.02811377
(Note. the one-sided nominal coverage probability is: .8)
------------------------------------------------

{com}. 
. persuasionyz voteddem_all post, level(90) method("bootstrap") nboot(1000) title("w/o covariates: bootstrap")
w/o covariates: bootstrap:
--- Estimating Average Persuation Rate (APR) ---
The estimated lower bound on the APR is:
.07073235
{txt}(running aprlb on estimation sample)

Bootstrap replications ({res}1000{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000
{res}
{txt}Bootstrap results{col 49}Number of obs{col 67}= {res}       701
{txt}{col 49}Replications{col 67}= {res}     1,000
{p2colset 7 17 21 2}{...}

{txt}{p2col :command:}aprlb voteddem_all post{p_end}
{p2colset 10 17 21 2}{...}
{p2col :coef:}{res:e(lb_coef)}{p_end}
--- Inference Based on Bootstrap ---
The left-end point of the percentile bootstrap confidence interval for the lower bound on the APR is:
.00367195
The left-end point of bc bootstrap confidence interval for the lower bound on the APR is:
.00763585
(Note. the one-sided nominal coverage probability is: .9)
------------------------------------------------

{com}. 
. tab cells, generate(cell_indicators)

     {txt}Strata {c |}
  indicator {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}          1        0.14        0.14
{txt}          2 {c |}{res}          7        1.00        1.14
{txt}          3 {c |}{res}          1        0.14        1.28
{txt}          4 {c |}{res}          1        0.14        1.43
{txt}          6 {c |}{res}          6        0.86        2.28
{txt}          7 {c |}{res}          7        1.00        3.28
{txt}          8 {c |}{res}          2        0.29        3.57
{txt}         10 {c |}{res}          8        1.14        4.71
{txt}         11 {c |}{res}         15        2.14        6.85
{txt}         12 {c |}{res}          2        0.29        7.13
{txt}         13 {c |}{res}          1        0.14        7.28
{txt}         14 {c |}{res}          3        0.43        7.70
{txt}         15 {c |}{res}          2        0.29        7.99
{txt}         17 {c |}{res}          1        0.14        8.13
{txt}         19 {c |}{res}          1        0.14        8.27
{txt}         20 {c |}{res}          4        0.57        8.84
{txt}         21 {c |}{res}          1        0.14        8.99
{txt}         22 {c |}{res}          3        0.43        9.42
{txt}         25 {c |}{res}          1        0.14        9.56
{txt}         29 {c |}{res}          2        0.29        9.84
{txt}         30 {c |}{res}          2        0.29       10.13
{txt}         34 {c |}{res}          4        0.57       10.70
{txt}         35 {c |}{res}         10        1.43       12.13
{txt}         36 {c |}{res}          2        0.29       12.41
{txt}         38 {c |}{res}          1        0.14       12.55
{txt}         39 {c |}{res}          1        0.14       12.70
{txt}         40 {c |}{res}         10        1.43       14.12
{txt}         41 {c |}{res}          9        1.28       15.41
{txt}         42 {c |}{res}          2        0.29       15.69
{txt}         43 {c |}{res}          1        0.14       15.83
{txt}         45 {c |}{res}         25        3.57       19.40
{txt}         46 {c |}{res}         28        3.99       23.40
{txt}         47 {c |}{res}          8        1.14       24.54
{txt}         48 {c |}{res}          5        0.71       25.25
{txt}         49 {c |}{res}          5        0.71       25.96
{txt}         50 {c |}{res}          2        0.29       26.25
{txt}         52 {c |}{res}          1        0.14       26.39
{txt}         54 {c |}{res}          3        0.43       26.82
{txt}         55 {c |}{res}         11        1.57       28.39
{txt}         56 {c |}{res}          2        0.29       28.67
{txt}         60 {c |}{res}          1        0.14       28.82
{txt}         62 {c |}{res}          5        0.71       29.53
{txt}         63 {c |}{res}          7        1.00       30.53
{txt}         64 {c |}{res}          3        0.43       30.96
{txt}         68 {c |}{res}          1        0.14       31.10
{txt}         69 {c |}{res}          6        0.86       31.95
{txt}         70 {c |}{res}         12        1.71       33.67
{txt}         71 {c |}{res}          1        0.14       33.81
{txt}         73 {c |}{res}          1        0.14       33.95
{txt}         74 {c |}{res}         16        2.28       36.23
{txt}         75 {c |}{res}          9        1.28       37.52
{txt}         78 {c |}{res}          1        0.14       37.66
{txt}         79 {c |}{res}          1        0.14       37.80
{txt}         80 {c |}{res}         12        1.71       39.51
{txt}         81 {c |}{res}         25        3.57       43.08
{txt}         82 {c |}{res}          9        1.28       44.37
{txt}         83 {c |}{res}          3        0.43       44.79
{txt}         84 {c |}{res}          2        0.29       45.08
{txt}         85 {c |}{res}          1        0.14       45.22
{txt}         86 {c |}{res}          3        0.43       45.65
{txt}         87 {c |}{res}          1        0.14       45.79
{txt}         89 {c |}{res}          1        0.14       45.93
{txt}         90 {c |}{res}          7        1.00       46.93
{txt}         91 {c |}{res}         13        1.85       48.79
{txt}         92 {c |}{res}          3        0.43       49.22
{txt}         93 {c |}{res}          1        0.14       49.36
{txt}         94 {c |}{res}          1        0.14       49.50
{txt}         96 {c |}{res}          1        0.14       49.64
{txt}         97 {c |}{res}          1        0.14       49.79
{txt}         98 {c |}{res}          1        0.14       49.93
{txt}        100 {c |}{res}          1        0.14       50.07
{txt}        101 {c |}{res}          7        1.00       51.07
{txt}        102 {c |}{res}          7        1.00       52.07
{txt}        103 {c |}{res}          1        0.14       52.21
{txt}        105 {c |}{res}          3        0.43       52.64
{txt}        106 {c |}{res}          4        0.57       53.21
{txt}        107 {c |}{res}          1        0.14       53.35
{txt}        110 {c |}{res}          1        0.14       53.50
{txt}        112 {c |}{res}          2        0.29       53.78
{txt}        113 {c |}{res}          1        0.14       53.92
{txt}        115 {c |}{res}          3        0.43       54.35
{txt}        116 {c |}{res}          1        0.14       54.49
{txt}        121 {c |}{res}          2        0.29       54.78
{txt}        122 {c |}{res}          1        0.14       54.92
{txt}        123 {c |}{res}          1        0.14       55.06
{txt}        124 {c |}{res}          1        0.14       55.21
{txt}        125 {c |}{res}          2        0.29       55.49
{txt}        127 {c |}{res}          3        0.43       55.92
{txt}        128 {c |}{res}          4        0.57       56.49
{txt}        129 {c |}{res}          2        0.29       56.78
{txt}        130 {c |}{res}          1        0.14       56.92
{txt}        131 {c |}{res}          1        0.14       57.06
{txt}        132 {c |}{res}         15        2.14       59.20
{txt}        133 {c |}{res}         11        1.57       60.77
{txt}        134 {c |}{res}          1        0.14       60.91
{txt}        137 {c |}{res}          7        1.00       61.91
{txt}        138 {c |}{res}         10        1.43       63.34
{txt}        139 {c |}{res}          1        0.14       63.48
{txt}        141 {c |}{res}          1        0.14       63.62
{txt}        143 {c |}{res}          1        0.14       63.77
{txt}        145 {c |}{res}          1        0.14       63.91
{txt}        146 {c |}{res}          1        0.14       64.05
{txt}        148 {c |}{res}          3        0.43       64.48
{txt}        150 {c |}{res}          1        0.14       64.62
{txt}        151 {c |}{res}          2        0.29       64.91
{txt}        153 {c |}{res}          1        0.14       65.05
{txt}        154 {c |}{res}         12        1.71       66.76
{txt}        155 {c |}{res}         10        1.43       68.19
{txt}        156 {c |}{res}          1        0.14       68.33
{txt}        157 {c |}{res}          1        0.14       68.47
{txt}        160 {c |}{res}         28        3.99       72.47
{txt}        161 {c |}{res}         27        3.85       76.32
{txt}        162 {c |}{res}          6        0.86       77.18
{txt}        164 {c |}{res}          3        0.43       77.60
{txt}        165 {c |}{res}          1        0.14       77.75
{txt}        166 {c |}{res}         32        4.56       82.31
{txt}        167 {c |}{res}         46        6.56       88.87
{txt}        168 {c |}{res}         14        2.00       90.87
{txt}        169 {c |}{res}          4        0.57       91.44
{txt}        170 {c |}{res}          6        0.86       92.30
{txt}        171 {c |}{res}          2        0.29       92.58
{txt}        172 {c |}{res}          1        0.14       92.72
{txt}        173 {c |}{res}          2        0.29       93.01
{txt}        175 {c |}{res}          1        0.14       93.15
{txt}        176 {c |}{res}          1        0.14       93.30
{txt}        177 {c |}{res}         11        1.57       94.86
{txt}        178 {c |}{res}         10        1.43       96.29
{txt}        179 {c |}{res}          3        0.43       96.72
{txt}        181 {c |}{res}          1        0.14       96.86
{txt}        182 {c |}{res}          1        0.14       97.00
{txt}        183 {c |}{res}          4        0.57       97.57
{txt}        184 {c |}{res}          2        0.29       97.86
{txt}        187 {c |}{res}          5        0.71       98.57
{txt}        188 {c |}{res}          6        0.86       99.43
{txt}        190 {c |}{res}          2        0.29       99.71
{txt}        191 {c |}{res}          1        0.14       99.86
{txt}        192 {c |}{res}          1        0.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        701      100.00
{txt}
{com}. 
. persuasionyz voteddem_all post $covariates doperator* cell_indicators*, level(80) nboot(1000) method("bootstrap") title("w covariates: bootstrap")
w covariates: bootstrap:
--- Estimating Average Persuation Rate (APR) ---
The estimated lower bound on the APR is:
.11861387
{txt}(running aprlb on estimation sample)

Bootstrap replications ({res}1000{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000
{res}
{txt}Bootstrap results{col 49}Number of obs{col 67}= {res}       701
{txt}{col 49}Replications{col 67}= {res}     1,000
{p2colset 7 17 21 2}{...}

{txt}{p2col :command:}aprlb voteddem_all post MBfemale Mreportedage MZBfemale MZreportedage MZBvoted2004 MZBvoted2002 MZBvoted2001 MZBconsumer MZBgetsmag MZBpreferrepub MZBprefernoone MZwave2 doperator1 doperator2 doperator3 doperator4 doperator5 doperator6 doperator7 doperator8 doperator9 doperator10 doperator11 doperator12 doperator13 doperator14 doperator15 doperator16 doperator17 doperator18 doperator19 doperator20 doperator21 doperator22 doperator23 doperator24 doperator25 doperator26 doperator27 doperator28 doperator29 doperator30 doperator31 doperator32 doperator33 doperator34 doperator35 doperator36 doperator37 doperator38 doperator39 doperator40 doperator41 doperator42 doperator43 doperator44 doperator45 doperator46 doperator47 doperator48 doperator49 doperator50 doperator51 doperator52 doperator53 doperator54 doperator55 doperator56 doperator57 doperator58 doperator59 doperator60 doperator61 doperator62 doperator63 doperator64 doperator65 doperator66 doperator67 doperator68 doperator69 doperator70 doperator71 doperator72 doperator73 doperator74 doperator75 doperator76 doperator77 doperator78 doperator79 doperator80 doperator81 doperator82 doperator83 doperator84 doperator85 doperator86 doperator87 doperator88 doperator89 doperator90 doperator91 doperator92 doperator93 doperator94 doperator95 doperator96 doperator97 doperator98 doperator99 doperator100 doperator101 cell_indicators1 cell_indicators2 cell_indicators3 cell_indicators4 cell_indicators5 cell_indicators6 cell_indicators7 cell_indicators8 cell_indicators9 cell_indicators10 cell_indicators11 cell_indicators12 cell_indicators13 cell_indicators14 cell_indicators15 cell_indicators16 cell_indicators17 cell_indicators18 cell_indicators19 cell_indicators20 cell_indicators21 cell_indicators22 cell_indicators23 cell_indicators24 cell_indicators25 cell_indicators26 cell_indicators27 cell_indicators28 cell_indicators29 cell_indicators30 cell_indicators31 cell_indicators32 cell_indicators33 cell_indicators34 cell_indicators35 cell_indicators36 cell_indicators37 cell_indicators38 cell_indicators39 cell_indicators40 cell_indicators41 cell_indicators42 cell_indicators43 cell_indicators44 cell_indicators45 cell_indicators46 cell_indicators47 cell_indicators48 cell_indicators49 cell_indicators50 cell_indicators51 cell_indicators52 cell_indicators53 cell_indicators54 cell_indicators55 cell_indicators56 cell_indicators57 cell_indicators58 cell_indicators59 cell_indicators60 cell_indicators61 cell_indicators62 cell_indicators63 cell_indicators64 cell_indicators65 cell_indicators66 cell_indicators67 cell_indicators68 cell_indicators69 cell_indicators70 cell_indicators71 cell_indicators72 cell_indicators73 cell_indicators74 cell_indicators75 cell_indicators76 cell_indicators77 cell_indicators78 cell_indicators79 cell_indicators80 cell_indicators81 cell_indicators82 cell_indicators83 cell_indicators84 cell_indicators85 cell_indicators86 cell_indicators87 cell_indicators88 cell_indicators89 cell_indicators90 cell_indicators91 cell_indicators92 cell_indicators93 cell_indicators94 cell_indicators95 cell_indicators96 cell_indicators97 cell_indicators98 cell_indicators99 cell_indicators100 cell_indicators101 cell_indicators102 cell_indicators103 cell_indicators104 cell_indicators105 cell_indicators106 cell_indicators107 cell_indicators108 cell_indicators109 cell_indicators110 cell_indicators111 cell_indicators112 cell_indicators113 cell_indicators114 cell_indicators115 cell_indicators116 cell_indicators117 cell_indicators118 cell_indicators119 cell_indicators120 cell_indicators121 cell_indicators122 cell_indicators123 cell_indicators124 cell_indicators125 cell_indicators126 cell_indicators127 cell_indicators128 cell_indicators129 cell_indicators130 cell_indicators131 cell_indicators132 cell_indicators133 cell_indicators134 cell_indicators135 cell_indicators136 cell_indicators137{p_end}
{p2colset 10 17 21 2}{...}
{p2col :coef:}{res:e(lb_coef)}{p_end}
--- Inference Based on Bootstrap ---
The left-end point of the percentile bootstrap confidence interval for the lower bound on the APR is:
.08606873
The left-end point of bc bootstrap confidence interval for the lower bound on the APR is:
.02840889
(Note. the one-sided nominal coverage probability is: .8)
------------------------------------------------

{com}. 
. 
{txt}end of do-file

{com}. 